УТ_для_edt.РасширениеСмарт/src/DataProcessors/ЖурналДокументовБезналичныеПлатежи/ЖурналДокументовБезналичныеПлатежи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЖурналДокументовБезналичныеПлатежи</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/РеестрДокументов/РеестрДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РеестрДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ДополнительнаяЗапись</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДатаПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Дополнительно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Проведен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДатаОтраженияВУчете</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>НомерПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>НомерДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44860178-ace4-11e7-7088-f45c898df8f7">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44863b70-ace4-11e7-7088-f45c898df8f7">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Ссылка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ТипСсылки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ДатаДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/ДополнительныеСведения/ДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3ad5d8a7-3071-46aa-aebf-306bdb67983b">
  <name>ДополнительныеСведения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ab7ef662-71c1-4d51-9f0f-ea8c5ea3df8a">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="cb954476-c551-4a06-9bcd-18d67ba47dc8">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="79201015-bfae-463e-81f1-0ae2d3066f3f">
    <name>Свойство</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/Documents/ПоступлениеБезналичныхДенежныхСредств/ПоступлениеБезналичныхДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПоступлениеБезналичныхДенежныхСредств</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВалютаКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроведеноБанком</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИдентификаторПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодтверждениеЗачисленияЗарплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>БанковскийСчетОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипПлатежногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПроведенияБанком</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассаОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументВыдачи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяАктивовПассивов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КурсКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СуммаКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смарт_ОплаченоЧерезКассуБанка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДанныеВыписки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e745a4f7-e3f0-43f6-9a5f-7aef0bc51a0b">
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Заказ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Организация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДоговорКредитаДепозита</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ОснованиеПлатежа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДоговорЗаймаСотруднику</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ТипСуммыКредитаДепозита</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВалютаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяДоходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаДоходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9c833630-69a2-4041-a061-4deff13f755d">
      <name>смартКурсДокумента</name>
      <comment>#1320 смарт: Лопато 01.03.2023 //Изменить порядок вычисленя Курса и Суммы взаиморасчета в валюте</comment>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/DataProcessors/ЖурналДокументовБезналичныеПлатежи/Forms/ФормаСписка/Module.bsl
#Область ПеренесеноСДоработкамиСмарт

&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	
	//++ смарт:Демичев №921 22.03.2022
    //мСпрСегментВип = Справочники.смартПредопределенныеЗначения.СегментВИППартнеров.Значение;
    //Если мСпрСегментВип <> Неопределено Тогда
    //	
    //	СписокПлатежей.ТекстЗапроса = СтрЗаменить(СписокПлатежей.ТекстЗапроса, "РегистрСведений.РеестрДокументов КАК РеестрДокументов", "
    //	|РегистрСведений.РеестрДокументов КАК РеестрДокументов
    //	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ПартнерыСегментаПериодический.СрезПоследних(, Сегмент = &ОтборСегментВип) КАК ПартнерыСегмента
    //	|	ПО  РеестрДокументов.Ссылка.Контрагент.Ссылка.Партнер = ПартнерыСегмента.Партнер"); 
    //	
    //	
    //	СписокПлатежей.ТекстЗапроса = СтрЗаменить(СписокПлатежей.ТекстЗапроса, "РеестрДокументов.Ссылка КАК Ссылка,", "РеестрДокументов.Ссылка КАК Ссылка,
    //	|ВЫБОР
    //	|	КОГДА  ПартнерыСегмента.Партнер  ЕСТЬ NULL
    //	|		ТОГДА Ложь
    //	|	Иначе Истина
    //	|КОНЕЦ КАК VIPклиент,");
    //	//
    //	
    //	СписокПлатежей.Параметры.УстановитьЗначениеПараметра("ОтборСегментВип",мСпрСегментВип);
    //			
    //	КолонкаВИП = Элементы.Вставить("VIPклиент", Тип("ПолеФормы"), Элементы.СписокПлатежей, Элементы.СписокПлатежейНомер);
    //	КолонкаВИП.ПутьКДанным = "СписокПлатежей.VIPклиент";
    //	КолонкаВИП.Заголовок = "VIP";
    //	КолонкаВИП.Вид = ВидПоляФормы.ПолеКартинки;
    //	КолонкаВИП.КартинкаЗначений = БиблиотекаКартинок.ДобавитьВИзбранное;
    //	
    //КонецЕсли;
	
	мСпрСегментВип = Справочники.смартПредопределенныеЗначения.СегментВИППартнеров.Значение;
    Если мСпрСегментВип <> Неопределено Тогда
		
		СписокПлатежей.ТекстЗапроса = СтрЗаменить(СписокПлатежей.ТекстЗапроса, "ВЫБРАТЬ",
		"ВЫБРАТЬ
		|	ПартнерыСегмента.Партнер КАК Партнер,
		|	ПартнерыСегмента.Сегмент КАК Сегмент
		|ПОМЕСТИТЬ ВТ_Сегмент
		|ИЗ
		|	РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
		|ГДЕ
		|	ПартнерыСегмента.Сегмент = &ОтборСегментВип
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ");
		
		
		СписокПлатежей.ТекстЗапроса = СтрЗаменить(СписокПлатежей.ТекстЗапроса, "РегистрСведений.РеестрДокументов КАК РеестрДокументов", "
		|РегистрСведений.РеестрДокументов КАК РеестрДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сегмент КАК ВТ_Сегмент
		|		ПО РеестрДокументов.Партнер = ВТ_Сегмент.Партнер");
 
	
		СписокПлатежей.ТекстЗапроса = СтрЗаменить(СписокПлатежей.ТекстЗапроса, "РеестрДокументов.Ссылка КАК Ссылка,", "РеестрДокументов.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ВТ_Сегмент.Партнер ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК VIPклиент,");

		
			СписокПлатежей.Параметры.УстановитьЗначениеПараметра("ОтборСегментВип",мСпрСегментВип);
					
			КолонкаВИП = Элементы.Вставить("VIPклиент", Тип("ПолеФормы"), Элементы.СписокПлатежей, Элементы.СписокПлатежейНомер);
			КолонкаВИП.ПутьКДанным = "СписокПлатежей.VIPклиент";
			КолонкаВИП.Заголовок = "VIP";
			КолонкаВИП.Вид = ВидПоляФормы.ПолеКартинки;
			КолонкаВИП.КартинкаЗначений = БиблиотекаКартинок.ДобавитьВИзбранное;

		
	КонецЕсли;
	//-- смарт:Демичев №921 22.03.2022	
		
	//++ смарт:ММ #004 102 04.12.2019
	ЗаявкиКОплате.ТекстЗапроса = СтрЗаменить(ЗаявкиКОплате.ТекстЗапроса, "ГрафикПлатежей.ДатаПлатежа КАК ДатаПлатежа,", 
		"ГрафикПлатежей.ДатаПлатежа КАК ДатаПлатежа,
		| ВЫБОР 
		|	КОГДА НЕ Заявка.Ссылка ЕСТЬ NULL
		|    	ТОГДА Заявка.КтоЗаявил
		|    ИНАЧЕ """"
		|КОНЕЦ КАК смартЗаявитель,");
	
	НоваяКолонка = ЭтаФорма.Элементы.Вставить("смартЗаявитель", Тип("ПолеФормы"), ЭтаФорма.Элементы.ЗаявкиКОплате, ЭтаФорма.Элементы.ЗаявкиКОплатеПолучатель);
    НоваяКолонка.Вид 			= ВидПоляФормы.ПолеВвода;
    НоваяКолонка.ПутьКДанным 	= "ЗаявкиКОплате.смартЗаявитель";
	НоваяКолонка.Заголовок 		= "Заявитель";
	//-- смарт:ММ 04.12.2019
	
	//++ #7488 смарт: Тимофеева 29.07.2026 / Загрузка выписки клиент-банка, фильтр загруженных документов
	СвойствоНомераЗаказовКлиентов = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул", "НомераЗаказовКлиентов");
	Если ЗначениеЗаполнено(СвойствоНомераЗаказовКлиентов) Тогда
		СписокПлатежей.ТекстЗапроса = СтрЗаменить(СписокПлатежей.ТекстЗапроса, "ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств КАК ДанныеПоступленияБезналичныхДС", "
			|ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств КАК ДанныеПоступленияБезналичныхДС
			|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК НомераЗаказовКлиентов
			|   		ПО (ДанныеПоступленияБезналичныхДС.Ссылка = НомераЗаказовКлиентов.Объект)
			|   			И (НомераЗаказовКлиентов.Свойство = &СвойствоНомераЗаказовКлиентов)}
			|");
			
	
		СписокПлатежей.ТекстЗапроса = СтрЗаменить(СписокПлатежей.ТекстЗапроса, "РеестрДокументов.Дополнительно КАК НазначениеПлатежа,", "РеестрДокументов.Дополнительно КАК НазначениеПлатежа,
			|ВЫБОР
			|	КОГДА НЕ НомераЗаказовКлиентов.Значение ЕСТЬ NULL
			|			И НЕ НомераЗаказовКлиентов.Значение = """"
			|			И (ДанныеПоступленияБезналичныхДС.НазначениеПлатежа ПОДОБНО ""%№ "" + (ВЫРАЗИТЬ(НомераЗаказовКлиентов.Значение КАК СТРОКА(11))) + "" от%""
			|			ИЛИ ДанныеПоступленияБезналичныхДС.НазначениеПлатежа ПОДОБНО ""%№"" + (ВЫРАЗИТЬ(НомераЗаказовКлиентов.Значение КАК СТРОКА(11))) + "" от%""
			|			ИЛИ ДанныеПоступленияБезналичныхДС.НазначениеПлатежа ПОДОБНО ""%N "" + (ВЫРАЗИТЬ(НомераЗаказовКлиентов.Значение КАК СТРОКА(11))) + "" от%""
			|			ИЛИ ДанныеПоступленияБезналичныхДС.НазначениеПлатежа ПОДОБНО ""%N"" + (ВЫРАЗИТЬ(НомераЗаказовКлиентов.Значение КАК СТРОКА(11))) + "" от%""
			|			ИЛИ ДанныеПоступленияБезналичныхДС.НазначениеПлатежа ПОДОБНО ""%по счету "" + (ВЫРАЗИТЬ(НомераЗаказовКлиентов.Значение КАК СТРОКА(11))) + "" от%"")
			|		ТОГДА ИСТИНА
			|	ИНАЧЕ ЛОЖЬ
			|КОНЕЦ КАК НомерЗаказаКлиентаЕстьВНазначении,");

		
		СписокПлатежей.Параметры.УстановитьЗначениеПараметра("СвойствоНомераЗаказовКлиентов", СвойствоНомераЗаказовКлиентов);	
    КонецЕсли;
	//-- #7488 смарт: Тимофеева 29.07.2026
КонецПроцедуры

&НаСервере
Процедура смарт_ПриЗагрузкеДанныхИзНастроекНаСервереПеред(Настройки)
//++ смарт:балашов #865 16.05.2023
	смартДобавлениеОтбораПоДатаДокумента()
//++ смарт:балашов #865 16.05.2023
КонецПроцедуры

&НаКлиенте
Процедура смарт_НачалоПериодаПриИзмененииПосле(Элемент)
//++ смарт:балашов #865 16.05.2023
	смартДобавлениеОтбораПоДатаДокумента();
//++ смарт:балашов #865 16.05.2023
КонецПроцедуры

&НаКлиенте
Процедура смарт_КонецПериодаПриИзмененииПосле(Элемент)
//++ смарт:балашов #865 16.05.2023
	смартДобавлениеОтбораПоДатаДокумента();
//++ смарт:балашов #865 16.05.2023
КонецПроцедуры

&НаСервере
&Перед("ПериодПриИзмененииНаСервере")
Процедура смарт_ПериодПриИзмененииНаСервере()
//++ смарт:балашов #865 16.05.2023
	смартДобавлениеОтбораПоДатаДокумента();
//++ смарт:балашов #865 16.05.2023
КонецПроцедуры

&НаСервере
Процедура смарт_СписокПлатежейПриСохраненииПользовательскихНастроекНаСервереПосле(Элемент, Настройки)
//++ смарт:балашов #865 24.05.2023
	НастройкиПользователя = СписокПлатежей.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	ПолеДата = Новый ПолеКомпоновкиДанных("Дата"); 
	Результат = смартПолучитьГруппуПользовательскойНастройки(НастройкиПользователя);
	ГруппаОтбора = Результат["ГруппаОтбора"];
    Если ГруппаОтбора <> Неопределено Тогда
		Для Каждого ЭлГруппыОтбора Из ГруппаОтбора.Элементы Цикл
			Если ЭлГруппыОтбора.ЛевоеЗначение = ПолеДата И ЭлГруппыОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
				Если ТипЗнч(ЭлГруппыОтбора.ПравоеЗначение) = Тип("Дата") Тогда
					НачалоПериода = ЭлГруппыОтбора.ПравоеЗначение;
				Иначе	
					НачалоПериода = ЭлГруппыОтбора.ПравоеЗначение.Дата;
				КонецЕсли;	
			ИначеЕсли ЭлГруппыОтбора.ЛевоеЗначение = ПолеДата И ЭлГруппыОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
				Если ТипЗнч(ЭлГруппыОтбора.ПравоеЗначение) = Тип("Дата") Тогда
					КонецПериода = ЭлГруппыОтбора.ПравоеЗначение;
				Иначе	
					КонецПериода = ЭлГруппыОтбора.ПравоеЗначение.Дата;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
//-- смарт:балашов #865 24.05.2023
КонецПроцедуры

#КонецОбласти                                

#Область ДоработкиСмарт

//++ смарт:балашов #865 24.05.2023 
&НаСервере
Функция смартПолучитьГруппуПользовательскойНастройки(НастройкиПользователя)
	//ЕстьНастройки = НастройкиПользователя.Количество() > 0; 
	ГруппаОтбора = Неопределено;
	Результат = Новый Соответствие;
	Результат.Вставить("ГруппаОтбора");
	Результат.Вставить("ЭлементНастройки");
	
	Если НастройкиПользователя <> Неопределено Тогда          
		Для Каждого НастройкаП Из НастройкиПользователя Цикл
			Если ТипЗнч(НастройкаП) = Тип("ОтборКомпоновкиДанных") Тогда
				Результат["ЭлементНастройки"] = НастройкаП;
				ПолеДата = Новый ПолеКомпоновкиДанных("Дата"); 
				Для Каждого ЭлементНастройкиП Из НастройкаП.Элементы Цикл
					Если (ТипЗнч(ЭлементНастройкиП) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных")) и (ЭлементНастройкиП.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ) Тогда
						ГруппаОтбора = ЭлементНастройкиП;		
						Результат["ГруппаОтбора"] = ГруппаОтбора;
						Прервать;
					КонецЕсли;	
				КонецЦикла;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;                   

	Возврат Результат;
КонецФункции	
//-- смарт:балашов #865 24.05.2023 

//++ смарт:балашов #865 24.05.2023
&НаСервере
Процедура смартДобавлениеОтбораПоДатаДокумента()
	//++проверка на существующий отбор пользоватоеля по дате 19.05.23
	НастройкиПользователя = СписокПлатежей.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	Результат = смартПолучитьГруппуПользовательскойНастройки(НастройкиПользователя);
	ГруппаОтбора = Результат["ГруппаОтбора"];
	НастройкаП   = Результат["ЭлементНастройки"];
	ПолеДата = Новый ПолеКомпоновкиДанных("Дата"); 

	Если ГруппаОтбора = Неопределено Тогда
		//проверим на совпадение отбора по дате             
		ГруппаОтбора = НастройкаП.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		ЭлементОтбора.ПравоеЗначение = НачалоДня(НачалоПериода);
		ЭлементОтбора.Использование = ЗначениеЗаполнено(НачалоПериода);
 
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлементОтбора.ПравоеЗначение = КонецДня(КонецПериода);	
		ЭлементОтбора.Использование = ЗначениеЗаполнено(КонецПериода);
	Иначе     
		Для Каждого ЭлГруппыОтбора Из ГруппаОтбора.Элементы Цикл
			Если ЭлГруппыОтбора.ЛевоеЗначение = ПолеДата И ЭлГруппыОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
				ЭлГруппыОтбора.ПравоеЗначение = НачалоДня(НачалоПериода);
				ЭлГруппыОтбора.Использование = ЗначениеЗаполнено(НачалоПериода);
			ИначеЕсли ЭлГруппыОтбора.ЛевоеЗначение = ПолеДата И ЭлГруппыОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
				ЭлГруппыОтбора.ПравоеЗначение = КонецДня(КонецПериода);
				ЭлГруппыОтбора.Использование = ЗначениеЗаполнено(КонецПериода);
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры
//-- смарт:балашов #865 24.05.2023
#КонецОбласти
